data/attachments/bdc594957dc4912a.txt

INFO     root:api_helper.py:33 Пользователь Derek Mcclure зарегистрирован
INFO     root:api_helper.py:33 Пользователь Sarah Fitzgerald зарегистрирован
INFO     root:allure_helpers.py:82 

REQUEST POST http://localhost:8089/ws

REQUEST HEADERS {
  "User-Agent": "python-requests/2.32.3",
  "Accept-Encoding": "gzip, deflate",
  "Accept": "*/*",
  "Connection": "keep-alive",
  "Content-Type": "text/xml;charset=UTF-8",
  "Content-Length": "983"
}

REQUEST BODY <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:updateUserRequest>
            <nif:user>
                <nif:id>1b121d3c-34a7-400e-8388-4d57ffe940bf</nif:id>
                <nif:username>Sarah Fitzgerald</nif:username>
                <!--Optional:-->
                <nif:firstname></nif:firstname>
                <!--Optional:-->
                <nif:surname></nif:surname>
                <!--Optional:-->
                <nif:fullname>Alexandria Wells</nif:fullname>
                <nif:currency>KZT</nif:currency>
                <!--Optional:-->
                <nif:photo></nif:photo>
                <!--Optional:-->
                <nif:photoSmall></nif:photoSmall>
                <!--Optional:-->
                <nif:friendshipStatus></nif:friendshipStatus>
            </nif:user>
        </nif:updateUserRequest>
    </soapenv:Body>
</soapenv:Envelope>

RESPONSE HEADERS {
  "Accept": "text/xml, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2",
  "SOAPAction": "\"\"",
  "Content-Type": "text/xml;charset=utf-8",
  "Content-Length": "458",
  "Date": "Mon, 23 Jun 2025 06:24:21 GMT",
  "Keep-Alive": "timeout=60",
  "Connection": "keep-alive"
}

RESPONSE BODY b'<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:userResponse xmlns:ns2="niffler-userdata"><ns2:user><ns2:id>1b121d3c-34a7-400e-8388-4d57ffe940bf</ns2:id><ns2:username>Sarah Fitzgerald</ns2:username><ns2:fullname>Alexandria Wells</ns2:fullname><ns2:currency>KZT</ns2:currency><ns2:friendshipStatus>VOID</ns2:friendshipStatus></ns2:user></ns2:userResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>'